export default [
  {
    type: 'INFP',
    name: '古君上神',
    description: '敏感、博爱、高尚、理想化、忠心耿耿。理想主义者，对于自己的价值观和自己觉得重要的人非常忠诚，很快能看到事情的可能性，能成为实现想法的催化剂，寻求理解别人和帮助他们实现潜能。\n\n深爱那些能进入他们内心圈子的人，保护着他人的感情安宁，对那些他们重视的人、事总是一丝不苟。\n\n他们敏感、理想化、忠诚，对于个人价值具有一种强烈的荣誉感。他们个人信仰坚定，有为自认为有价值的人、事献身的精神。\n\n他们思维开阔、有好奇心和洞察力，常常具有出色的长远眼光。\n\n在日常事务中，他们通常灵活多变，具有忍耐力和适应性，但是他们非常坚定地对待内心的忠诚，他们往往承担得太多，但不管怎样总要完成。'
  },
  {
    type: 'ISFJ',
    name: '天帝',
    description: '安静、友好，有责任感和良知，坚定地致力于完成他们的义务。\n\n全面、勤勉、精确，忠诚、体贴，留心和记得他们重视的人的小细节，关心他人的感受，努力把工作和家庭环境营造得有序而温馨。\n\n他们相信现存的体系，认为它们之所以存在是因为能够正常运转。因此，他们不会尝试用新的方法来解决问题，除非让他们明确地看出其相对于旧方法的优势所在。\n\n这类人群是极端可靠的，他们拥有强烈的责任感和使命感。他们对待自己的责任认真严肃，而且绝对会从一而终。正是出于这种原因，人们总会信任依赖于他们。每当别人要求他们做某事时，他们很难拒绝对方，并可能因此而让自己负担过重。他们对于自身以及他人的内在感受极为敏感。他们通常不轻易流露自己的情感，而是将它们留在自己心里。\n\n他们需要从他人那里得到正面的回馈。当缺少正面回馈，他们会显得消沉，甚至可能会变得郁郁寡欢。当他们意志消沉或承受巨大压力之时，他们就开始设想那些生活中可能会出现的致命错误。他们会强烈谴责自己。他们最大的愿望是对他人有用并能够照顾他人，使之远离生活中的缺陷和危险，他们在这个过程中得到无限的满足。\n\n作为父母，他们温和地对待孩子，并认为自己有责任促使孩子们遵守社会规范，让孩子们远离诡诈和危险。其实，他们更应该懂得鼓励孩子的独立性。'
  },
  {
    type: 'ISTP',
    name: '东华上君',
    description: '长于分析，敏于观察，聪明睿智，足智多谋。擅长于分析情形接近问题的核心，因此他们可以即刻完成功能性的补救，是个安静的观察者。\n\n擅长分析事物运作的原理，能从大量的信息中很快找到关键的症结所在。对于原因和结果感兴趣，用逻辑的方式处理问题，重视效率。虽然他们是冷静的观察者，但当问题出现时，便迅速行动，找出可行的解决方法。\n\n他们能够很快分析哪些东西可以使事情进行顺利，又能够从大量资料中找出实际问题的重心。他们很重视事件的前因后果，能够以理性的原则把事实组织起来。\n\n他们重视效率，注重实用性，尊重事实，寻求有利方法，具有现实性，只信服被论证的结果。喜欢独立工作，依靠逻辑和足智多谋解决即时出现的组织问题。他们好奇心强，而且善于观察，只有理性、可靠的事实才能使他们信服，形成他们的知识宝库。他们是现实主义者，所以能够很好地利用可获得的资源，同时他们擅于把握时机，这使他们变得很讲求实效。'
  },
  {
    type: 'ISFP',
    name: '景涧',
    description: '安静、友好、敏感、和善。对于自己的价值观和自己觉得重要的人非常忠诚，有责任心。不喜欢争论和冲突，不会将自己的观念和价值观强加到别人身上。\n\n他们友好谦逊，感情投入，关心人，并能真挚对待。对批评很敏感，容易受伤；温柔文静，谈吐文雅；平易近人。欣赏目前和他们周遭所发生的事情。喜欢有自己的空间，做事又能把握自己。\n\n他们更多是通过行为而不是言辞表达自己深沉的情感。\n\n他们谦虚而缄默，但实际上他们是具有巨大的友爱和热情之人，但是除了与他们相知和信赖的人在一起外，他们不经常表现出自我的另一面。因为他们不喜欢直接地自我表达，所以常常被误解。\n\n他们耐心、灵活，很容易与他人相处，很少支配或控制别人。他们很客观，以一种相当实事求是的方式接受他人的行为。恋爱对他们而言，是一种“要不就是拥有全世界，要不就一无所有”的体验。由于他们倾向于把自己封闭在小世界里，以执着的心去感受爱情，所以也有可能因为爱情而受伤害。因为他们是会为了爱情做任何事情的一类人。奉献和柔顺是他们带给一段感情最重要的两个特质，他们只会真心且几近天真地表达爱意。'
  },
  {
    type: 'INTJ',
    name: '白玦',
    description: '他们具有独特的思想、伟大的远见和梦想。他们是优秀的战略思想家，能清楚地看到任何局势的优势和缺陷。为了自己的计划，他们会投入不可思议的专心、注意力和能量、积极性。依靠到达或超过自己的高标准的决心和坚韧不拔，他们获得许多成就。\n\n他们天生善于谋篇布局，每一步都体现着思考和智慧，时刻评估着对策、战术和备用方案，确保比对手更快一步，以保持对情况的控制并获得最大程度的自由。他们高瞻远瞩，考虑周全，决不会在计划中遗漏任何重要的环节或步骤。\n\n他们思维严谨、有逻辑性、足智多谋，他们能够看到新计划实行后的结果和生活中转变为真实物质的体系。他们对自己和别人都很苛求，往往几乎同样强硬地逼迫别人和自己。他们并不十分受冷漠与批评的干扰，是所有人中最独立的。\n\n他们更喜欢以自己的方式行事。面对相反意见，他们通常持怀疑态度，十分坚定和坚决。权威本身不能强制他们，只有他们认为这些规则对自己的更重要的目标有用时，才会去遵守。在实现自己的想法和达成自己的目标时有创新的想法和非凡的动力。能很快洞察到外界事物间的规律并形成长期的远景计划。一旦决定做一件事就会开始规划并直到完成为止。\n\n他们是完美主义者。他们强烈地要求个人自由和能力，同时在他们独创的思想中，不可动摇的信仰将促使他们达到目标。\n\n通常，他们会承担起解决复杂问题的责任，并施展他们创造性的才能担当起领导者的工作。\n\n他们对爱情有纯粹而执着的追求，当他们认定一个人，至死不渝。'
  },
  {
    type: 'ISTJ',
    name: '森鸿',
    description: '安静、严肃，通过全面性和可靠性获得成功。\n\n他们实际，有责任感，并一步步朝着目标前进，不易分心。他们是严肃的、有责任心的和通情达理的社会坚定分子。他们值得信赖，他们重视承诺，对他们来说，言语就是庄严的宣誓。\n\n他们头脑缜密，讲求实际，具有很强的集中力、条理性和准确性。无论他们做什么，都相当有条理和可靠。他们具有坚定不移、深思熟虑的思想，一旦他们着手自己相信是最好的行动方法时，就很难转变或变得沮丧。\n\n他们安静而勤奋，对于细节有很强的记忆和判断。他们能够引证准确的事实支持自己的观点，把过去的经历运用到现在的决策中。他们重视和利用逻辑、客观分析，以坚持不懈的态度准时地完成工作，并且总是安排有序，很有条理。'
  },
  {
    type: 'INFJ',
    name: '元启',
    description: '忠诚、坚定，富有理想，珍视正直。\n\n他们生活在思想的世界里。他们是独立的、有独创性的思想家，具有强烈的感情、坚定的原则和正直的人格。即使面对怀疑，他们仍相信自己的看法与决定，这种内在的观念激发着他们的积极性。通常他们具有本能的洞察力，能够看到事物更深层的含义。\n\n他们本身具有深厚复杂的性格，既敏感又热切。他们内向，很难被人了解，但是愿意同自己信任的人分享内在的自我。他们往往有一个交往深厚、持久的小规模的朋友圈，在合适的氛围中能产生充分的个人热情和激情。\n\n在学校里，他们通常都是好学生，享受解决难题带来的乐趣，严肃对待工作。他们在需要与人们相互施加影响的领域显得精力旺盛，为个人发展提供养分。\n\n在恬静的外表下，他们对人生重要大事有着更深的信仰。他们通常不是为了个人的辉煌或权利而工作，而是为了自己的信仰而战！\n\n没有谁会比他们经历更多的挫折与考验，在危难之时经常能看到他们奔走急救的身影。他们的身上体现了一种持节正义的观念，所以他们会成为伟大的领导者。由于他们的贡献，他们通常会受到尊重或敬佩。他们善于赢得他人的合作，他们愿意毫无保留地激励同伴。他们满怀热情与同情心，注意其他人的情感和利益，能够很好地处理复杂的人际关系。他们是深思熟虑的决策者，在行动之前他们通常要仔细考虑。\n\n他们是不容易受人牵制的，他们在任何时候都不易被愚弄欺骗。虽然他们很通情达理，并富有同情心，但是他们对朋友却是很挑剔的，这种友谊是以相互间的信赖为基础的。'
  },
  {
    type: 'INTP',
    name: '炙阳',
    description: '沉默、自主、思维敏捷、洞察力强。喜欢理论上或科学方面的追求，喜爱用逻辑和分析解决问题。喜欢提出新的见解和主张，不大喜欢聚会和闲聊天。喜欢从事与自己的兴趣或爱好相适应的工作。\n\n客观、批判性强，倾向于通过自己的思考去寻找事物的基本原理。独立解决问题，对一个观点或形势能做出超出常人的独立的准确分析。他们几乎都有自己擅长的一个或多个相关领域，可以用天赋异禀来形容，他们在专业上凭借超群的悟性可以用很短的时间达到很多人可能花掉数年数十年甚至一辈子也无法企及的高度。\n\n他们独立而沉静，思维宽广而富有创新精神，好奇而进取，理智随和而适应能力强，有主见而不盲目附从。\n\n他们是兄长类的人物，顾全大局，是理性的问题解决者。他们富有才智和条理性，外表平静、缄默、超然，但内心却专心致志于分析问题。他们努力寻找和利用原则以理解许多想法。他们喜欢有条理和目的的交谈，只有有条理的推理才会使他们信服。'
  },
  {
    type: 'ENTJ',
    name: '上古',
    description: '他们是天生的领导者，天生具有魅力和信心，他们所散发的权威性能召集大家为着一个共同目标努力。他们的性格中有着近乎残酷的理性，用强大的动力、坚定的决心和锋芒毕露的思想实现为自己制订的一切目标。\n\n如果有什么东西是他们所热爱的，那一定非挑战莫属。无论挑战大小，他们都会坚定地相信，只要有足够的时间和资源，就没有无法达成的目标。他们高瞻远瞩，能够将精力长期集中在自己的目标上，并且按部就班地执行自己的计划，矢志不移，目标明确，从而最终成为强大的领导者。在为达到既定目的的过程中，他们也身先士卒，极富牺牲与奉献精神。\n\n他们的决断通常是一种自我实现的预言，因为他们会凭借纯粹的意志力努力达成目标，如果换成其他人则可能半途而废，另寻出路，而他们本身的感召力也会激励着他们身边的人，并取得丰硕的成果。\n\n他们善于做长期的计划和目标的设定。通常见多识广，博览群书，喜欢拓广自己的知识面并将此分享给他人。在陈述自己的想法时非常强而有力。他们注重真理，只有在经过逻辑推理之后他们才会信服。他们在作计划和研究新事物时是很系统化的。\n\n但感情方面他们通常是迟钝和后知后觉的，只有天长日久的陪伴才能打动他们。'
  },
  {
    type: 'ENTP',
    name: '天启',
    description: '反应快、睿智，有激励别人的能力，警觉性强、直言不讳。在解决新的、具有挑战性的问题时机智而有策略。善于找出理论上的可能性，然后再用战略的眼光分析。\n\n不喜欢例行公事，很少会用相同的方法做相同的事情，喜欢兴奋与挑战。他们热情开放、足智多谋、健谈而聪明，擅长于许多事情，不断追求增加能力和个人权力。\n\n他们天生富有想象力，他们深深地喜欢新思想，留心一切可能性。他们通常有很强的首创精神。\n\n他们视灵感高于其他的一切，力求使他们的新颖想法转变为现实。他们好奇、多才多艺、适应性强，在解决挑战性和理论性问题时善于随机应变。\n\n他们灵活而率直，能够轻易地看出任何情况中的缺点，喜欢出于兴趣争论问题的某方面。他们有极好的分析能力，是出色的策略谋划者。他们几乎一直能够为他们所希望的事情找出符合逻辑的推理。\n\n他们喜欢审视周围的环境，认为多数的规则和章程如果不被打破，便意味着屈从。有时他们的态度不从习俗，可能会做出超出可被接受和被期望的事情。他们喜欢自在地生活，在每天的生活中寻找快乐和变化。'
  },
  {
    type: 'ESTJ',
    name: '凤染',
    description: '他们直爽坦率，友善合群。爱奉献，有尊严，他们的明确建议和指导被人看重，也愿意披荆斩棘，带领大家努力前行。他们会因为团结大家而骄傲，常常承担起组织者的角色，他们坚信律法的规则和掌握权力的重要性，他们的领导方式是以身作则，尽心尽力，诚实果断。\n\n他们对周围的事务了如指掌，生活在一个由明确的事实组成的世界。对自己知识的确定性，使他们能够在受到很大阻力时依然能坚守原则，并坚持明确的是非观。\n\n他们的看法绝非纸上谈兵，而是非常愿意深入研究最具挑战性的项目，并在过程中改进行动计划和捋清细节，即便是最复杂的任务，也会因此变得简单可行。\n\n这种类型的人言出必行，如果合作伙伴或下属的无能甚至是欺诈行为威胁到承诺的兑现，他们绝不会压抑怒火。因为他们相信价值观是社会良性运行的基础。\n\n他们在实施计划时强而有力。他们喜欢操纵局势和促使事情发生，他们具有责任感，信守他们的承诺。他们不但能很轻松地判断别人，而且还是条理分明的纪律执行者。'
  },
  {
    type: 'ESFP',
    name: '月弥',
    description: '他们观察力敏锐，能够非常敏感地捕捉到他人的情绪。他们常常也是第一个让别人坦率地说出棘手问题的人，他们非常乐意提供情感支持和实用的建议。\n\n外向，友善，包容。热爱生活和物质上的享受，喜欢与别人共事。讲究常识和实用性，注意现实的情况，使事物富有趣味性。\n\n他们富有灵活性、即兴性，自然不做作，易接受新朋友和适应新环境。\n\n他们乐意与人相处，有一种真正的生活热情。他们顽皮活泼，通过真诚和玩笑使别人感到事情更加有趣。\n\n他们大多脾气随和、适应性强，热情友好和慷慨大方。他们擅长交际，常常是大家的“注意中心”。'
  },
  {
    type: 'ESTP',
    name: '常沁',
    description: '灵活、忍耐力强，实际，注重结果。觉得理论和抽象的解释十分无趣，喜欢积极地采取行动解决问题。\n\n他们注重当前，自然不做作，享受和他人在一起的时刻。他们学习新事物最有效的方式是通过亲身感受和练习，喜欢行动而不是空谈。\n\n当问题出现时，他们乐于去处理。他们是优秀的解决问题的人，这是因为他们能够掌握必要的事实情况，然后找到符合逻辑的明智的解决途径。他们愿意冒险和尝试新事物，愿意接受不同而不会随波逐流。\n\n他们有稳定的心态，有冲劲和闯劲，不患得患失。他们不会瞻前顾后，他们会在前进的过程中改正错误，而不是闲坐着思考备用计划和撤退方案。\n\n他们激情满怀，能量爆棚，还有一个理性的大脑。他们具有启发性，令人信服，生活丰富多彩，是天生的团队领导者，他们会带领大家走上一条少有人走的道路，为人们的所到之处带来生机与乐趣。\n\n他们认为使用自己的道德标准比使用别人的更有意义。对他们来说规则就是用来打破的。如果他们能在枯燥的事情上投入更多精力和关注，他们的能力将不可限量。'
  },
  {
    type: 'ENFP',
    name: '景昭',
    description: '热情洋溢、富有想象力，认为人生有很多的可能性。能很快地将事情和信息联系起来，然后很自信地根据自己的判断解决问题。\n\n稍欠成熟的他们可能时刻都需要感觉到自己是注意的焦点，希望大家都认为自己很棒，很迷人。\n\n对于自己认定的人或事，经常会有强烈的信仰，有时甚至会有一种破釜沉舟的决心。\n\n他们不墨守成规，善于发现做事情的新方法，为思想或行为开辟新路，并保持它们的开放。在此过程中，他们依赖冲动的能量，在这种能量的指引下展开行动。'
  },
  {
    type: 'ESFJ',
    name: '红日',
    description: '热心肠、有责任心、合作，事无巨细都会保持忠诚，能体察到他人在日常生活中的所需并竭尽全力帮助。希望自己和自己的所为能受到他人的认可和赏识。\n\n他们很忠诚于权威，他们心甘情愿地为上级劳动，这是他们生命的意义所在，同时希望自己的下级也能如此。通常他们很果断，坚定地表达自己的主张。他们讲求实际、实事求是和安排执行。他们参与并能记住重要的事情和细节，乐于别人也能对自己的事情很确信。他们在自己的个人经历或在他们所信赖之人的经验之上制订计划或得出见解。\n\n他们通常非常传统化，恪守自己的责任与承诺。他们自觉承担起照顾身边的人的责任，无论走到哪里都会承担着奉献者的角色：愉快地付出自己的时间和精力，以确保别人的需要得到满足、传统得到维持和发展，并圆满履行其职责。'
  },
  {
    type: 'ENFJ',
    name: '三首火龙',
    description: '热情、为他人着想、有责任心，十分聪明。\n\n他们非常注重他人的感情、需求和动机，善于发现他人的潜能，并希望能帮助他们实现。他们通常能成为个人或群体成长和进步的催化剂。\n\n他们对于赞扬和批评都会积极地回应。友善，好社交，在团体中能很好地帮助他人，并有鼓舞他人的领导能力。他们也是理想主义者，看重自己的价值。\n\n他们对于自己尊重景仰的人、事、物都非常忠诚，他们有精力、热情同时又有责任感，同时具有聪慧、坚持不懈的特点。'
  }
];
